rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 10]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = $1  [["director", "James"]]
---
  def same_director
    @movie = Movie.find(params[:id]) #retrieve movie id from URI route
    if @movie.director.blank?